In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("/Users/jonathanmair/Dropbox/coding/cuota/data/Spain_Bases_de_Cotizacion_2020_2024.csv")

In [8]:
bases = df.iloc[: , 0:3]

In [11]:
tipos = pd.read_csv("/Users/jonathanmair/Dropbox/coding/cuota/data/Spain_Social_Security_Contributions_2020-2024.csv")

In [28]:
tipo_trabajador = 6.35
years = bases["Year"].unique()
cols = ["min", "max", "cuota"]
base_col = "Base Min (Euros/Month)"

In [14]:
min = 0
for year in years:

Index(['Year', 'Contribution Group', 'Base Min (Euros/Month)'], dtype='object')

In [27]:
bases[bases["Year"] == 2024]

   Year  Contribution Group  Base Min (Euros/Month)
0  2024                   1                  1847.4
1  2024                   2                  1532.1
2  2024                   3                  1332.9
3  2024                   4                  1323.0
4  2024                   5                  1323.0
5  2024                   6                  1323.0
6  2024                   7                  1323.0

In [20]:
bases.head()

   Year  Contribution Group  Base Min (Euros/Month)
0  2024                   1                  1847.4
1  2024                   2                  1532.1
2  2024                   3                  1332.9
3  2024                   4                  1323.0
4  2024                   5                  1323.0